In [2]:
import pandas as pd 
from pandas import Series, DataFrame

In [3]:
# 적용함수 
# 함수에 데이터들의 일부를 전달, 함수의 적용이 반복되도록 도와주는 함수>>메소드

In [4]:
DataFrame([['1,200','1,300'],['1,400','1,500']], columns = ['A','B'])

       A      B
0  1,200  1,300
1  1,400  1,500

In [5]:
df1 = DataFrame([['1,200','1,300'],['1,400','1,500']], columns = ['A','B'])

In [6]:
df1.dtypes

A    object
B    object
dtype: object

In [8]:
df1['A']

0    1,200
1    1,400
Name: A, dtype: object

In [9]:
df1['A'].sum() 
# 문자열 결합 >> 문자의 연장
# 1,200 + 1,400

'1,2001,400'

In [10]:
type(df1['A'].sum() )

str

In [13]:
df1['A'].str.replace(',','')

0    1200
1    1400
Name: A, dtype: object

In [13]:
df1['A'].str.replace(',','')
# 컬럼 각 값에 replace 전달, 반복 연산 처리해 줌

0    1200
1    1400
Name: A, dtype: object

In [15]:
# df1.str.replace(',','')
# AttributeError: 'DataFrame' object has no attribute 'str'
# 데이터프레임 형태는 string(문자) 속성이 없음

1. applymap 
- DataFrame 객체에서 호출 가능 
- 2차원 데이터의 각 원소별 함수 적용 
- 추가객체, 함수의 추가 옵션 전달 불가

In [16]:
f1 = lambda x : int(x.replace(',','')) 
# 문자열 메소드 활용 함수 정의

In [17]:
df1

       A      B
0  1,200  1,300
1  1,400  1,500

In [18]:
df1.applymap(f1)

      A     B
0  1200  1300
1  1400  1500

In [19]:
df1 = df1.applymap(f1)
df1

      A     B
0  1200  1300
1  1400  1500

In [20]:
df1.dtypes

A    int64
B    int64
dtype: object

[ 참고 : replace 메소드 종류 ]

In [24]:
# '1,200'.str.replace(',','')
# AttributeError: 'str' object has no attribute 'str'
# replace()함수 적용 불가(문자열은 str 메소드 호출 불가)

In [25]:
'1,200'.replace(',','')

'1200'

In [27]:
'a/b/c'.split('/')

['a', 'b', 'c']

In [28]:
Series(['a/b/c','A/B/C'])

0    a/b/c
1    A/B/C
dtype: object

In [29]:
Series(['a/b/c','A/B/C']).str.split('/')

0    [a, b, c]
1    [A, B, C]
dtype: object

2. map 메소드 
- Series 에서 호출 가능 
- 1차원 
- 매 원소별 함수 적용
- 추가 객체, 함수의 추가 옵션 전달 불가

In [31]:
f2 = lambda x : x.split('/')[0]
Series(['a/b/c','A/B/C']).map(f2)
# Series 각각의 원소를 함수에 전달

0    a
1    A
dtype: object

In [33]:
Series(['a/b/c','A/B/C'])

0    a/b/c
1    A/B/C
dtype: object

In [34]:
Series(['a/b/c','A/B/C'])[0]

'a/b/c'

In [35]:
Series(['a/b/c','A/B/C'])[1]

'A/B/C'

3. apply
- DataFrame 호출 가능 
- 각 행별, 각 컬럼별 적용 가능(**)
- 함수의 추가 옵션 전달 가능

In [36]:
df1

      A     B
0  1200  1300
1  1400  1500

In [37]:
df1.sum()

A    2600
B    2800
dtype: int64

In [38]:
df1.sum(axis=0) # 서로 다른 행끼리, 세로 방향

A    2600
B    2800
dtype: int64

In [39]:
df1.sum(axis=1) # 서로 다른 열끼리, 가로 방향

0    2500
1    2900
dtype: int64

In [40]:
df1.apply(sum, axis=0) # 행 별 총합2

A    2600
B    2800
dtype: int64

In [41]:
df1.apply(sum, axis=1) # 열 별 총합

0    2500
1    2900
dtype: int64

[참고: map() 함수와 .map 메소드의 차이]
- map()함수 : 1차원 자료구조에 사용(list, array, Series)
- Series 객체.map